This is a little bit large, when importing legacy that haven't been updated in a long time and have the `default` instance configuration ID, there's a few issues:

```diff
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ec_deployment.example_minimal must be replaced
-/+ resource "ec_deployment" "example_minimal" {
      + apm_secret_token       = (sensitive value)
        deployment_template_id = "default"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      ~ id                     = "XXXXY" -> (known after apply)
      ~ name                   = "ear" -> "my_example_deployment"
      + region                 = "us-east-1" # forces replacement
      + version                = "7.9.2"

      ~ elasticsearch {
          ~ cloud_id       = "ear:dXMtZWFzdC0xLmF3cy5mb3VuZC5pbyQxOGZjOTZjNDkxYjNkNWUxMGUxNDc0NjM5MjdhNTM0OSRiOTgwZjllZjRhZjg0ZDc4ODUxZGRmNzlmNDM5YWQ4ZA==" -> (known after apply)
          ~ http_endpoint  = "http://XXXXY.us-east-1.aws.found.io:9200" -> (known after apply)
          ~ https_endpoint = "https://XXXXY.us-east-1.aws.found.io:9243" -> (known after apply)
          ~ ref_id         = "elasticsearch" -> "main-elasticsearch"
          ~ region         = "us-east-1" -> (known after apply)
          ~ resource_id    = "XXXXY" -> (known after apply)
          ~ version        = "2.4.5" -> (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + memory_per_node           = "2g"
              + node_count_per_zone       = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + zone_count                = 2
            }
        }

      ~ kibana {
          ~ elasticsearch_cluster_ref_id = "elasticsearch" -> "main-elasticsearch"
          ~ http_endpoint                = "http://YYYYX.us-east-1.aws.found.io:9200" -> (known after apply)
          ~ https_endpoint               = "https://YYYYX.us-east-1.aws.found.io:9243" -> (known after apply)
          ~ ref_id                       = "kibana" -> "main-kibana"
          ~ region                       = "us-east-1" -> (known after apply)
          ~ resource_id                  = "YYYYX" -> (known after apply)
          ~ version                      = "4.6.6" -> (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + memory_per_node           = (known after apply)
              + node_count_per_zone       = (known after apply)
              + zone_count                = (known after apply)

              + config {
                  + user_settings_json          = (known after apply)
                  + user_settings_override_json = (known after apply)
                  + user_settings_override_yaml = (known after apply)
                  + user_settings_yaml          = (known after apply)
                }
            }
        }

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```